In [1]:
import pandas as pd

# Создаём DataFrame из двух генераторов списков

In [3]:
df = pd.DataFrame([
    [i for i in range(100)],
    ["a" + str(i) for i in range(100)]
                  ])
df.T

     0    1
0    0   a0
1    1   a1
2    2   a2
3    3   a3
4    4   a4
..  ..  ...
95  95  a95
96  96  a96
97  97  a97
98  98  a98
99  99  a99

[100 rows x 2 columns]

# Создаём DataFrame из двух генераторов словарей

In [5]:
df = pd.DataFrame({
    'number': [i for i in range(100)],
    'char': ['a' + str(i) for i in range(100)]
})
df

    number char
0        0   a0
1        1   a1
2        2   a2
3        3   a3
4        4   a4
..     ...  ...
95      95  a95
96      96  a96
97      97  a97
98      98  a98
99      99  a99

[100 rows x 2 columns]

# Обращаемся по ключу к колонке

In [7]:
type(df['number'])

pandas.core.series.Series

In [8]:
df[['number']]

    number
0        0
1        1
2        2
3        3
4        4
..     ...
95      95
96      96
97      97
98      98
99      99

[100 rows x 1 columns]

In [9]:
df['char'][3]

'a3'

In [10]:
df.loc[6, 'char']

'a6'

In [11]:
df.loc[6:12:3, ['char', 'number']]

   char  number
6    a6       6
9    a9       9
12  a12      12

# Метод iloc: вместо названий колонок используются их порядковые номера, им можно менять значения

In [13]:
df.iloc[1:4:1, 1] = 'test'
df

    number  char
0        0    a0
1        1  test
2        2  test
3        3  test
4        4    a4
..     ...   ...
95      95   a95
96      96   a96
97      97   a97
98      98   a98
99      99   a99

[100 rows x 2 columns]

# df.query - возвращает файл dataframe, содержащий фильтрованные строки

In [18]:
df.query('char == "test"')

   number  char
1       1  test
2       2  test
3       3  test

# Альтернативный, более быстрый способ - использование loc'a

In [20]:
df.loc[df.char == 'test']

   number  char
1       1  test
2       2  test
3       3  test

In [28]:
df['char']
df.char.apply("name")
df

    number  char
0        0    a0
1        1  test
2        2  test
3        3  test
4        4    a4
..     ...   ...
95      95   a95
96      96   a96
97      97   a97
98      98   a98
99      99   a99

[100 rows x 2 columns]

In [32]:
fun = lambda x: x + "_curse"

In [34]:
fun('test')

'test_curse'

In [40]:
df.char.apply(lambda x: x + "_curse") #apply возвращает копию

0       a0_curse
1     test_curse
2     test_curse
3     test_curse
4       a4_curse
         ...
95     a95_curse
96     a96_curse
97     a97_curse
98     a98_curse
99     a99_curse
Name: char, Length: 100, dtype: object

In [42]:
df.char + '_curse'

0       a0_curse
1     test_curse
2     test_curse
3     test_curse
4       a4_curse
         ...
95     a95_curse
96     a96_curse
97     a97_curse
98     a98_curse
99     a99_curse
Name: char, Length: 100, dtype: object